#============================================================================================================
#
#	拡張機能 - 名無し名変更
#	0ch_nanasiname.pl
#
#============================================================================================================
package ZPL_nanasiname;



#------------------------------------------------------------------------------------------------------------
#	拡張機能名称取得
#------------------------------------------------------------------------------------------------------------
sub getName
{
	return '名無し名変更';
}

#------------------------------------------------------------------------------------------------------------
#	拡張機能説明取得
#------------------------------------------------------------------------------------------------------------
sub getExplanation
{
	return '>>1が本文ににコマンド「!774任意の名無し!3」を入力することで名無し名を変更することができます。';
}

#------------------------------------------------------------------------------------------------------------
#	拡張機能タイプ取得
#------------------------------------------------------------------------------------------------------------
sub getType
{
	return 1|2;
}

#------------------------------------------------------------------------------------------------------------
#	設定リスト取得 (0ch+ Only)
#------------------------------------------------------------------------------------------------------------
sub getConfig
{
	return {};
}

#------------------------------------------------------------------------------------------------------------
#	拡張機能実行インタフェイス
#------------------------------------------------------------------------------------------------------------
sub execute
{
	my $this = shift;
	my ($Sys, $Form, $type) = @_;
	
	my $CGI = $Sys->Get('MainCGI');
	my $Threads = $CGI->{'THREADS'} || $Sys->Get('_THREAD_');
	my $threadid = $Sys->Get('KEY');
	
	# スレッド属性情報を読み込む
	$Threads->LoadAttr($Sys);
	
	# キャップ管理モジュールを準備
	my $Sec = SECURITY->new;
	$Sec->Init($Sys);
	$Sec->SetGroupInfo($bbs);
	
	# 各種情報を取得
	my $name = $Form->Get('FROM');
	my $mail = $Form->Get('mail');
	my $MESSAGE = $Form->Get('MESSAGE');
	my $tate = $Sys->Equal('MODE', 1);
	my $bbs = $Sys->Get('BBS');
	my $capid = $Sys->Get('CAPID', '');
	my $admin = $capid && $Sec->IsAuthority($capid, 0, '*');
	my $kote = $capid && $Sec->IsAuthority($capid, $ZP::CAP_DISP_HANLDLE, $bbs);
	
	# ユーザー識別IDを取得 (表示されるIDとは別)
	my $clientid = $Sys->Get('KOYUU');
	
	# スレ主かどうか
	my $isowner = 0;

	# スレ主の識別IDを取得
	my $owner = $Threads->GetAttr($threadid, 'owner');
	# 記録されたパスワードを取得
	my $pass = $Threads->GetAttr($threadid, 'ownerpass');
	# ユーザーがスレ主と同じ識別IDなら
	if ($clientid eq $owner) {
		$isowner = 1;
		
	# そうでなければパスワードによる判定
	} elsif ($mail =~ s/!owner:([^:]+)://g) {
		# メール欄を再設定
		$Form->Set('mail', $mail);
		# パスワードを照合
		if ($pass ne '' && $pass eq $1) {
			$isowner = 1;
		}
	}

	# bbs.cgi (書き込み時)
	if ($type == 1) {
		# キャップ または >>1 なら設定可
		if ($admin || $tate) {
			if ($MESSAGE =~ s/!774(.+?)!3?$/!774$1!3 <br> <span style="color:red"><small>名無し名: $1<\/small><\/span>/g) {
				$Form->Set('MESSAGE', $MESSAGE);
				$Threads->SetAttr($threadid, '774', "!$1");
			}
			$Threads->SaveAttr($Sys);
		}
	}elsif ($type == 2 && $isowner == 1){
		# キャップ または >>1 なら設定可
		if ($admin || $tate) {
			if ($MESSAGE =~ s/!774(.+?)!3?$/!774$1!3 <br> <span style="color:red"><small>名無し名: $1<\/small><\/span>/g) {
				$Form->Set('MESSAGE', $MESSAGE);
				$Threads->SetAttr($threadid, '774', "!$1");
			}
			$Threads->SaveAttr($Sys);
		}
	}
	
	my $nanasiname = $Threads->GetAttr($threadid, '774');
	if ($nanasiname =~ /^!(.*)$/) {
		# コテ★は影響しない
		if (!$kote) {
			# トリップ許可
			if ($name =~ /#|＃/) {
				$name =~ s/^.*(#|＃)/\1/;
				$Form->Set('FROM', $name);
			} else {
				$Form->Set('FROM', $1);
			}
		}
	}
	
	return 0;
}

#------------------------------------------------------------------------------------------------------------
#	なんちゃってbbs.cgiエラーページ表示
#------------------------------------------------------------------------------------------------------------
sub PrintBBSError
{
	my ($Sys, $err) = @_;
	
	require './module/orald.pl';
	
	my $CGI = $Sys->Get('MainCGI');
	my $Page = $CGI->{'PAGE'};
	
	my $Error = ORALD->new;
	$Error->Load($Sys);
	$Error->Print($CGI, $Page, $err, $Sys->Get('AGENT'));
	
	$Page->Flush('', 0, 0);
	
	exit($err);
}



#------------------------------------------------------------------------------------------------------------
#	コンストラクタ
#------------------------------------------------------------------------------------------------------------
sub new
{
	my $class = shift;
	my ($Config) = @_;
	
	my $this = {};
	bless $this, $class;
	
	if (defined $Config) {
		$this->{'PLUGINCONF'} = $Config;
		$this->{'is0ch+'} = 1;
	}
	else {
		$this->{'CONFIG'} = $class->getConfig();
		$this->{'is0ch+'} = 0;
	}
	
	return $this;
}

#------------------------------------------------------------------------------------------------------------
#	設定値取得 (0ch+ Only)
#------------------------------------------------------------------------------------------------------------
sub GetConf
{
	my $this = shift;
	my ($key) = @_;
	if ($this->{'is0ch+'}) {
		return $this->{'PLUGINCONF'}->GetConfig($key);
	}
	elsif (defined $this->{'CONFIG'}->{$key}) {
		return $this->{'CONFIG'}->{$key}->{'default'};
	}
}

#------------------------------------------------------------------------------------------------------------
#	設定値設定 (0ch+ Only)
#------------------------------------------------------------------------------------------------------------
sub SetConf
{
	my $this = shift;
	my ($key, $val) = @_;
	if ($this->{'is0ch+'}) {
		$this->{'PLUGINCONF'}->SetConfig($key, $val);
	}
	elsif (defined $this->{'CONFIG'}->{$key}) {
		$this->{'CONFIG'}->{$key}->{'default'} = $val;
	}
	else {
		$this->{'CONFIG'}->{$key} = { 'default' => $val };
	}
}

#============================================================================================================
#	Module END
#============================================================================================================
1;